# KeynoteEntries Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeynoteEntries Properties
KeynoteEntries Class See Also
---
The KeynoteEntries type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from KeyBasedTreeEntries.) |

# See Also
KeynoteEntries Class
Autodesk.Revit.DB Namespace